Tekla Open API Reference for Tekla Structures 2025
AngleTypes Enumeration
 The different types for angle dimensions.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum AngleTypes
Public Enumeration AngleTypes
Members
Member name | Value | Description
AngleOnSide | 1 |  Shows the angle dimensions in degrees on the side.
AngleAtVertex | 3 |  Shows the angle dimensions in degrees at the angle vertex.
Triangle | 2 |  Shows the angle dimensions using a triangle. The triangle base length can be configured.
TriangleWithDegrees | 4 |  Shows the angle using a triangle, also shows the angle in degrees on one side of the triangle.
AngleOnSideGradian | 5 |  Shows the angle dimensions in gradians on the side.
AngleAtVertexGradian | 6 |  Shows the angle dimensions in gradians at the angle vertex.
TriangleWithGradians | 7 |  Shows the angle using a triangle, also shows the angle in gradians on one side of the triangle.
See Also
Reference
Tekla.Structures.Drawing Namespace